#+TITLE: Experiment 3: Preprocessing
#+PROPERTY: header-args:R :session *R* :results silent :tangle scripts/01_preprocess.R

* Preprocessing of main trials

#+BEGIN_SRC R 
  message("    Preprocessing test trials...")

  trn2 <- read_csv("coding/train_trls.csv", col_types = "iciciccccllc") %>%
    select(-ShiftDir, PercCon, PragCon) %>%
    inner_join(conds %>% select(SessionID, Series, shift_dir),
               c("SessionID", "Series")) %>%
    mutate(misspec = ((shift_dir == "Singleton-Contrast") &
                      (Modifier == 1L)) |
             ((shift_dir == "Contrast-Singleton") &
              (Modifier == 0L))) %>%
    select(SessionID, Series, Modifier, misspec, Transcription)

  tst2 <- read_csv("coding/test_trls_FPchange.csv",
                   col_types = "iciccicciccll") %>%
    select(-ShiftDir, -PercCon, -PragCon) %>%
    inner_join(conds, c("SessionID", "Series")) %>%
    mutate(misspec = ((shift_dir == "Singleton-Contrast") &
                      (Adjective %in% c("NO", "AS", "AO", "DE", "AS/AO"))) |
             ((shift_dir == "Contrast-Singleton") &
              (Adjective != "NO"))) %>%
    select(SessionID, Series,
           shift_dir,
           Modifier, misspec, Adjective, Fluency=SpeechFluency,
           Transcription)

  ## are there any that we need to delete?
  bad_items <- trn2 %>%
    inner_join(conds, c("SessionID", "Series")) %>%
    group_by(Series, shift_dir) %>%
    summarize(m = mean(misspec, na.rm = TRUE)) %>%
    ungroup() %>%
    filter(m >= .5) 

  bad_subjs <- trn2 %>%
    inner_join(conds, c("SessionID", "Series")) %>%
    anti_join(bad_items, c("Series", "shift_dir")) %>%
    group_by(SessionID, shift_dir) %>%
    summarize(m = mean(misspec, na.rm = TRUE)) %>%
    ungroup() %>%
    filter(m > .5)

  bad_trials <- trn2 %>%
    mutate(invalid = misspec | is.na(misspec),
           reason = case_when(is.na(misspec) ~ "couldn't code",
                              TRUE ~ "inappropriate description at training"))  %>%
    filter(invalid) %>%
    anti_join(bad_items, "Series") %>%
    anti_join(bad_subjs, "SessionID") %>%
    select(SessionID, Series, reason)

  main_data <- tst2 %>%
    anti_join(bad_items, "Series") %>%
    anti_join(bad_subjs, "SessionID") %>%
    anti_join(bad_trials, c("SessionID", "Series")) %>%
    inner_join(conds, c("SessionID", "Series", "shift_dir"))

  n_subj_tot <- tst2 %>% distinct(SessionID) %>% nrow()
  n_subj_bad <- nrow(bad_subjs) # * 48
  n_itm_bad <- nrow(bad_items) # * 40 
  n_poss_trials <- (n_subj_tot - n_subj_bad) * 48

  # number of remaining trials
  n_trials_tot <- nrow(tst2 %>%
                       anti_join(bad_subjs, "SessionID") %>%
                       anti_join(bad_items, "Series"))
  n_trials_bad_code <-
    nrow(bad_trials %>% filter(reason == "couldn't code"))
  n_trials_invalid <- nrow(bad_trials) - n_trials_bad_code
#+END_SRC

#+RESULTS:
: 128

